[{"id":1,"title":"St Peters Church","subTitle":"The heart of the village","pageText":"Dating from the 12th century, a statue - presumably of St Peter - can be seen above the main south door. \nIn 1993 the west end of the church was tastefully re-designed to provide the parish with a meeting room and kitchen facilities.<br />\nThe vicarage, now a private house and known as 'The Old Rectory', was built in 1872. It has seen many vicars, but none so infamous as the Rev William Bryant MA who used to walk around the church tower, calling his parishioners to worship. He shot himself, in the vicarage, in 1914. His burial on 3rd November 1914 took place without the services of the Church of England.\nSt Peter's Church of Stoke Lyne dates back to the 14th Century and is architecturally beautiful inside and out, well worth a lingering pause.\n<br />\n\n**1st Sunday** of the month - 10.45am Group Family Service<br />\n**2nd Sunday** of the month - 6pm Evening Prayer (every 3 months)<br />\n**3rd Sunday** of the month - 9.15am Holy Communion 4.30pm Fun Church<br />\n**4th Sunday** of the month - 10.45am Family Morning Worship<br />\n\nEveryone is welcome to attend.<br />\nFull details of services will be found on the church notice board, The Church Page on our website and in the monthly parish newsletter. <br />\n\n**Parish News:** The monthly Parish news gives details of forthcoming events in the 10 parishes, including local as well as church events.<br />\n\n**Group Rector:** Rev Alice Goodall, The Rectory, Water Stratford road, Finmere 01280 848192 email: calicegoodall313@gmail.com<br />\n\n**Assistant Priests:**<br />\nRev. Bill Muncey, 10c St Michael's Close, Fringford 278972 email: munceybill@gmail.com<br />\nRev. Liz Welters, 19 Scampton Close, Bicester 249481 email: lizwelters@yahoo.co.uk<br />\nLicensed Lay Minister: Mrs Penny Wood, 8 Crosslands, Fringford 277310 email: penelope.wood@btopenworld.com<br />\nChurchwardens: Alison Miller miller203@btinternet.com 07762 719198 Email: hmhb10@googlemail.com<br />\nChristopher Poole Church Barn Stoke Lyne Oxon OX27 8RU Tel: 01869 346020 Email: ctp@oxford-educational.co.uk<br />\n\n**Parish Meeting room Booking clerk:**<br />\nMr James Holden-White, 6 The Close, Stoke Lyne 345211\n\n**Treasurer:**<br />\nMr Brian Penhallow, Meadow Cottage, The Street, Stoke Lyne 346733","slug":"church","published_at":"2021-10-14T13:09:43.690Z","created_at":"2021-10-14T13:09:42.545Z","updated_at":"2021-10-14T13:49:34.621Z","optionalComponents":[],"featureImage":{"id":5,"name":"church_outline.png","alternativeText":"","caption":"","width":640,"height":480,"formats":{"thumbnail":{"name":"thumbnail_church_outline.png","hash":"thumbnail_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":208,"height":156,"size":9.18,"path":null,"url":"/uploads/thumbnail_church_outline_7ddd38ba1a.png"},"small":{"name":"small_church_outline.png","hash":"small_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":500,"height":375,"size":32.93,"path":null,"url":"/uploads/small_church_outline_7ddd38ba1a.png"}},"hash":"church_outline_7ddd38ba1a","ext":".png","mime":"image/png","size":44.61,"url":"/uploads/church_outline_7ddd38ba1a.png","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2021-10-14T12:42:26.429Z","updated_at":"2021-10-14T12:42:26.438Z"}},{"id":2,"title":"Stoke Lyne Diggers","subTitle":" The story so far...","pageText":"I think the initial idea for the allotments came from a conversation that was had after the success of the new play equipment in the park. This was all thanks to the amazing effort of Ginny Duffell and I think that after this, anything seemed possible.<br />\n\nOf course the idea wouldn't have got any further if it hadn't been for Bob Wheatcroft. He knew who the field next to the playing field belonged to but even better, how to get in contact with the owner, Mr Barnett, to see if there was any hope of securing it for allotments. His initial enquiry met with a positive response and from there a very slow negotiation process commenced.<br />\n\nI was also spurred on because a close friend of mine had recently acquired an allotment in Launton and despite the pressure and time restraints of work and children, was thoroughly enjoying her allotment not just the digging and growing side of it but the sense of friendship and community that it had brought to her village. This was definitely what Stoke Lyne needed. Although we are a very friendly village there was no shop or school to help bring people together and I felt that we needed to build on our sense of community.<br />\n\nThe Parish Council agreed to help with the legal side of things and one of the Parish Councillors, Hugo Brown, very kindly said that he would allow us to have a metered water supply from his horse trough in the neighbouring field.<br />\n\nThe next hurdle was to see how many villagers would actually be interested in having an allotment, amazingly 25 people came forward and although some have had to drop out for various reasons 18 of our allotments have been taken.<br />\n\nI thought I would see if there was any funding available for us, I was surprised at how difficult this was. Cherwell District Council don't have any help available for allotments and most of the charities that I contacted either said that they wouldn't' donate to allotments or that we would have to have been established for more than a year to be eligible. Eventually I came across the Doris Field Trust which is a local charity managed by a firm of solicitors in Headington. Doris Field was a local lady who left a considerable sum to charity. They agreed to give us a donation of £1000!<br />\n\nWe plan to use this money for costs involved with water, fences and hedging on the Stratton Lane to help protect our crops and to keep the area safe for young children who may be on the allotment with their parents.<br />\n\nOn the day of the Royal Wedding we had an allotment opening ceremony alongside the street party and Bob Wheatcoft made a speech and cut ribbon. People were then invited to wander around and have a look at what we have achieved so far. We are all very proud of our initial success and look forward to more people from the village joining us in the future.<br />\n\n**Pippa Elliot**","slug":"diggers","published_at":"2021-10-18T10:21:37.573Z","created_at":"2021-10-18T10:21:26.580Z","updated_at":"2021-10-18T10:21:37.586Z","optionalComponents":[],"featureImage":{"id":5,"name":"church_outline.png","alternativeText":"","caption":"","width":640,"height":480,"formats":{"thumbnail":{"name":"thumbnail_church_outline.png","hash":"thumbnail_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":208,"height":156,"size":9.18,"path":null,"url":"/uploads/thumbnail_church_outline_7ddd38ba1a.png"},"small":{"name":"small_church_outline.png","hash":"small_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":500,"height":375,"size":32.93,"path":null,"url":"/uploads/small_church_outline_7ddd38ba1a.png"}},"hash":"church_outline_7ddd38ba1a","ext":".png","mime":"image/png","size":44.61,"url":"/uploads/church_outline_7ddd38ba1a.png","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2021-10-14T12:42:26.429Z","updated_at":"2021-10-14T12:42:26.438Z"}},{"id":3,"title":"The views around Stoke Lyne","subTitle":"","pageText":"There are many miles of bridleways, woodland, fields and streams to walk through. A final stop at the pub sounds almost too inviting.","slug":"views","published_at":"2021-10-18T10:24:34.287Z","created_at":"2021-10-18T10:24:29.890Z","updated_at":"2022-05-07T13:25:48.950Z","optionalComponents":[{"__component":"galleries.image-gallery","id":1,"images":[{"id":30,"name":"IMG_20171203_153150.jpg","alternativeText":"","caption":"","width":4160,"height":3120,"formats":{"thumbnail":{"name":"thumbnail_IMG_20171203_153150.jpg","hash":"thumbnail_IMG_20171203_153150_409f88b3f7","ext":".jpg","mime":"image/jpeg","width":208,"height":156,"size":7.75,"path":null,"url":"/uploads/thumbnail_IMG_20171203_153150_409f88b3f7.jpg"},"large":{"name":"large_IMG_20171203_153150.jpg","hash":"large_IMG_20171203_153150_409f88b3f7","ext":".jpg","mime":"image/jpeg","width":1000,"height":750,"size":145.02,"path":null,"url":"/uploads/large_IMG_20171203_153150_409f88b3f7.jpg"},"medium":{"name":"medium_IMG_20171203_153150.jpg","hash":"medium_IMG_20171203_153150_409f88b3f7","ext":".jpg","mime":"image/jpeg","width":750,"height":563,"size":84.65,"path":null,"url":"/uploads/medium_IMG_20171203_153150_409f88b3f7.jpg"},"small":{"name":"small_IMG_20171203_153150.jpg","hash":"small_IMG_20171203_153150_409f88b3f7","ext":".jpg","mime":"image/jpeg","width":500,"height":375,"size":37.66,"path":null,"url":"/uploads/small_IMG_20171203_153150_409f88b3f7.jpg"}},"hash":"IMG_20171203_153150_409f88b3f7","ext":".jpg","mime":"image/jpeg","size":1765.27,"url":"/uploads/IMG_20171203_153150_409f88b3f7.jpg","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2022-05-07T13:23:37.096Z","updated_at":"2022-05-07T13:23:37.102Z"},{"id":29,"name":"20210414_182915.jpg","alternativeText":"","caption":"","width":4032,"height":1908,"formats":{"thumbnail":{"name":"thumbnail_20210414_182915.jpg","hash":"thumbnail_20210414_182915_4629cf8e47","ext":".jpg","mime":"image/jpeg","width":245,"height":116,"size":10.71,"path":null,"url":"/uploads/thumbnail_20210414_182915_4629cf8e47.jpg"},"large":{"name":"large_20210414_182915.jpg","hash":"large_20210414_182915_4629cf8e47","ext":".jpg","mime":"image/jpeg","width":1000,"height":473,"size":158.5,"path":null,"url":"/uploads/large_20210414_182915_4629cf8e47.jpg"},"medium":{"name":"medium_20210414_182915.jpg","hash":"medium_20210414_182915_4629cf8e47","ext":".jpg","mime":"image/jpeg","width":750,"height":355,"size":92.93,"path":null,"url":"/uploads/medium_20210414_182915_4629cf8e47.jpg"},"small":{"name":"small_20210414_182915.jpg","hash":"small_20210414_182915_4629cf8e47","ext":".jpg","mime":"image/jpeg","width":500,"height":237,"size":40.72,"path":null,"url":"/uploads/small_20210414_182915_4629cf8e47.jpg"}},"hash":"20210414_182915_4629cf8e47","ext":".jpg","mime":"image/jpeg","size":1712.3,"url":"/uploads/20210414_182915_4629cf8e47.jpg","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2022-05-07T13:23:37.043Z","updated_at":"2022-05-07T13:23:37.052Z"},{"id":28,"name":"20210121_164126.jpg","alternativeText":"","caption":"","width":4608,"height":2184,"formats":{"thumbnail":{"name":"thumbnail_20210121_164126.jpg","hash":"thumbnail_20210121_164126_cebe5b97a2","ext":".jpg","mime":"image/jpeg","width":245,"height":116,"size":5.47,"path":null,"url":"/uploads/thumbnail_20210121_164126_cebe5b97a2.jpg"},"large":{"name":"large_20210121_164126.jpg","hash":"large_20210121_164126_cebe5b97a2","ext":".jpg","mime":"image/jpeg","width":1000,"height":474,"size":49.05,"path":null,"url":"/uploads/large_20210121_164126_cebe5b97a2.jpg"},"medium":{"name":"medium_20210121_164126.jpg","hash":"medium_20210121_164126_cebe5b97a2","ext":".jpg","mime":"image/jpeg","width":750,"height":355,"size":30.84,"path":null,"url":"/uploads/medium_20210121_164126_cebe5b97a2.jpg"},"small":{"name":"small_20210121_164126.jpg","hash":"small_20210121_164126_cebe5b97a2","ext":".jpg","mime":"image/jpeg","width":500,"height":237,"size":15.79,"path":null,"url":"/uploads/small_20210121_164126_cebe5b97a2.jpg"}},"hash":"20210121_164126_cebe5b97a2","ext":".jpg","mime":"image/jpeg","size":862.78,"url":"/uploads/20210121_164126_cebe5b97a2.jpg","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2022-05-07T13:23:37.020Z","updated_at":"2022-05-07T13:25:45.884Z"}]}],"featureImage":{"id":5,"name":"church_outline.png","alternativeText":"","caption":"","width":640,"height":480,"formats":{"thumbnail":{"name":"thumbnail_church_outline.png","hash":"thumbnail_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":208,"height":156,"size":9.18,"path":null,"url":"/uploads/thumbnail_church_outline_7ddd38ba1a.png"},"small":{"name":"small_church_outline.png","hash":"small_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":500,"height":375,"size":32.93,"path":null,"url":"/uploads/small_church_outline_7ddd38ba1a.png"}},"hash":"church_outline_7ddd38ba1a","ext":".png","mime":"image/png","size":44.61,"url":"/uploads/church_outline_7ddd38ba1a.png","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2021-10-14T12:42:26.429Z","updated_at":"2021-10-14T12:42:26.438Z"}},{"id":4,"title":"About Stoke Lyne","subTitle":"Memories of Stoke Lyne","pageText":"### RON AND PAT SHELTON\nIn 1977, my late husband, Ron. and I moved from Melbourne, Australia into 28 Stoke Lyne at the end of the village. It was very dilapidated, consisting originally 2 workman's cottages. They had been converted to one house, without water, or a well that didn't work. Ron dug a water line to Sheep-wash across the neighbouring farm lands, so that we could have running water. We paid the owner for the rights to do that. A HUGE job! We were Australian Ballroom Dance champions and were teaching in Bicester, while looking for a pub to buy. During the renovations, Ron had a sudden fatal heart attack in 1978 and passed away at aged 46. I was devastated, but continued with the renovations. They turned 28 Stoke Lyne into a lovely stone cottage, very much bigger than originally. I met and 3 years later married Cliff Astley, a widower in the village with 3 sons, whose mother, Clarice, had died 7 years earlier. They lived at the Forge, which I bought from local farmers, John and Pam (?) whose names I can't remember, unfortunately. I brought Cliff, Philip 20, David,17 and Martin,15, to Australia after we were married in 1981. Cliff died in 1993 with cancer. I also had cancer in 1998, but recovered. I don't have any connection with the sons now, although some with Martin, always a delightful boy and now, man. I wish he and his lovely wife, Joanne well. They have 4 children, 2 sons and pretty twin girls. All Cliff's sons have done extremely well in Australia, which I don't think would have happened if they'd stayed in Stoke Lyne. The villagers of Stoke Lyne were a lovely group of people. I went back in 2000 and met up with the Tyacks again. The Forge and surrounds had been developed, and are looking very pleasant. Selling that was a terrible drama! So much trickery! Doubtful that I'll be back... so many memories of bad events, but lovely Stoke Lyne people.. Thank you all!!!<br/>\n<br/>\n \n### STOKE LYNE SCHOOL\nI lived in Tusmore from about 1950 to Nov 1953 when we emigrated to New Zealand. I used to travel in a small van across Tusmore Park to school. Miss Saville was the teacher and my mother worked as her assistant for a few months. I visited Miss Saville in her retirement whilst in the UK in 1962. A TV was brought in for us to watch the Queen's coronation and that was the first time I saw television. I recall not liking the school dinners and every new child was initiated by having to stand all alone on the shoe grating against the wall before the other children started to make friends. It was awful. My mother went to the Women's Institute at Tusmore House and I was the sailor for them in a show. Names which come to mind are my friend, Fenella, who lived in a cottage on the Estate and the English boys who lived near me in a house which had a turret tower. There was a large chestnut tree by the school and we liked having conker fights! The van's drop-off point was outside the village shop. I am visiting Tusmore and Buckinghamshire in May (2011) from NZ with the aim of going down memory lane revisiting my childhood there up until the age of 8. I wonder where my contemporaries are now?<br/>\n<br/>\n \n### GARDEN COTTAGE, TUSMORE PARK\nI lived in Tusmore Park in the late 1950s and early 1960s. My name was Susan Barnsley. My dad Ken was gardener in the enclosed Victorian garden and I remember living in Garden Cottage which backed onto the gardens, there was also a racing stables run by Mr Keane. I remember my best friend in the park was Suzanne Clark, the gamekeeper's daughter, she had a brother called Rodney who was friends with Trevor Keane, son of the stable manager, We used to play in the grounds of the big house, as we called it, there were small ponds with newts in, we were not really supposed to play there but we did. I also went to school in Stoke Lyne and I remember Miss Saville and another teacher, Miss Andsell, Names from school I recall are Susan Turzack, Poppy Squires, Ann Miller, Pat and John Jones. I also had a friend called Wendy Burnham who lived at the crossroads towards Bicester where you turned off to go to Stoke Lyne. I remember walking through a woodland tunnel from Tusmore part of the way to Stoke Lyne, and I remember being in the Brownies and going to our Brown Owl's wedding at Stoke Lyne church. It was a magical childhood living there. I remember going horse riding on Mrs Brown's farm just outside the park. I loved living in Tusmore. My brother also went motorbike scrambling near Stoke Lyne.","slug":"history","published_at":"2021-10-18T10:27:39.617Z","created_at":"2021-10-18T10:27:31.515Z","updated_at":"2021-10-18T10:32:10.822Z","optionalComponents":[],"featureImage":{"id":5,"name":"church_outline.png","alternativeText":"","caption":"","width":640,"height":480,"formats":{"thumbnail":{"name":"thumbnail_church_outline.png","hash":"thumbnail_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":208,"height":156,"size":9.18,"path":null,"url":"/uploads/thumbnail_church_outline_7ddd38ba1a.png"},"small":{"name":"small_church_outline.png","hash":"small_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":500,"height":375,"size":32.93,"path":null,"url":"/uploads/small_church_outline_7ddd38ba1a.png"}},"hash":"church_outline_7ddd38ba1a","ext":".png","mime":"image/png","size":44.61,"url":"/uploads/church_outline_7ddd38ba1a.png","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2021-10-14T12:42:26.429Z","updated_at":"2021-10-14T12:42:26.438Z"}},{"id":5,"title":"The Peyton Arms","subTitle":"Our beautiful little pub","pageText":"Situated in a rural farming community, within easy reach of junction 10 of the M40, this pub has no hand-pumps - 2 local Hook Norton Brewery ales are served direct from the cask. The hosts are local legends, very much a part of the character of the pub. A good old-fashioned hostelry for great conversation in a warm, friendly environment, the bar is adults only - but children are welcome in the garden. No food but simple rolls are available. Phone ahead for weekday opening hours.\n\nBeautifully situated and largely unspoilt one-room stone-built alehouse, character landlord (Mick the Hat) and loyal regulars, very well kept Hook Norton from casks behind small corner bar, filled rolls, inglenook fire, tiled floor and lots of memorabilia, games area with darts and pool; no children or dogs; pleasant garden with Aunt Sally. Open all day Sat, closed Sun evening.\n\n### History\nFormed from two early 19th century stone properties and originally a village shop and simple, unspoilt bar. It was sold to Hook Norton in 1954 by the Peyton estate and the modest bar counter in the small main bar in the middle of the pub was probably fitted up very shortly after that. There are a few old shelves for a bar back, old stone fireplace, bench and window seating. In the distant past there was a small wooden partial partition to create a small snug/booth area to the right as you entered the main bar room. There is a small room to the left of the main bar i.e. at the front of the building. It was originally the private lounge when the pub was run for fifty years by two sisters, with only occasional public use. Nowadays it is in pub use, and has a large stone fireplace and service via a stable door. The beer and lager is fetched from the cellar situated between the two rooms which is not much bigger than a passage.\n\nhttp://www.hooky.co.uk/content/our-pubs/peyton-arms-stoke-lyne.ashx","slug":"the-peyton-arms","published_at":"2021-10-18T10:28:52.998Z","created_at":"2021-10-18T10:28:20.063Z","updated_at":"2021-10-18T10:31:21.092Z","optionalComponents":[],"featureImage":{"id":5,"name":"church_outline.png","alternativeText":"","caption":"","width":640,"height":480,"formats":{"thumbnail":{"name":"thumbnail_church_outline.png","hash":"thumbnail_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":208,"height":156,"size":9.18,"path":null,"url":"/uploads/thumbnail_church_outline_7ddd38ba1a.png"},"small":{"name":"small_church_outline.png","hash":"small_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":500,"height":375,"size":32.93,"path":null,"url":"/uploads/small_church_outline_7ddd38ba1a.png"}},"hash":"church_outline_7ddd38ba1a","ext":".png","mime":"image/png","size":44.61,"url":"/uploads/church_outline_7ddd38ba1a.png","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2021-10-14T12:42:26.429Z","updated_at":"2021-10-14T12:42:26.438Z"}},{"id":6,"title":"About Stoke Lyne","subTitle":" Find out about local amenities and the history of Stoke Lyne","pageText":"This geographically large parish stretches from the Ockley Brook on the county boundary with Northamptonshire in the north, to Bainton in the south, and from Hethe Brede Farm in the east to the B430 by Ardley in the west. The landscape has changed in recent years. The M40 junction 10 is on the Ardley boundary. Nearby the Woodland Trust administers Stoke Wood which was formerly part of the Peyton estate. This has a car park and various walks, and is across the B4100 from the Stoke Lyne junction.\nThe parish includes several farms, a service station at Baynards Green on the B4100 Banbury road, the Peyton Arms public house and housing, farmland and several small woods. The land on which a small primary school stood until 1985 has been redeveloped at St Peter's Close, an area of detached houses. Bicester, together with Bicester Village Retail Centre, lies to the south just 4 miles away and Oxford is 14 miles, Banbury 10 miles to the northwest, and Brackley 7 miles away. Milton Keynes and Aylesbury are northeast and east respectively, each about 23 miles distant.<br />\nAt the centre of the parish is the village of Stoke Lyne with the church of St Peter. The parish itself is one of ten parishes grouped together as one benefice, the Shelswell Group. It is part of the Bicester and Islip Deanery, which is in turn part of the Oxford Diocese\nThe Church has a kitchen and toilets and the construction of a folding screen across the nave, which allows the west end to be used as a meeting room when required - the Parish Meeting Room which is available for hire.\nMain village events may include the annual Fun Day held on the patronal festival day in June, the harvest service and supper and the senior citizens' party. <br />\n\n### SCHOOLS\nPrimary School children (aged 5-11 years) attend Fritwell School, a minibus calls at the church corner for them. Secondary School children usually attend Cooper School or Bicester Community College (both of which are in Bicester). A coach collects them at church corner at 8.00am and returns at 4.10pm. There are playgroups in the surrounding villages.<br />\n\n### HEALTH\n#### Doctors:\nThere are several practices in Bicester, including two working from Bicester Health Centre, Coker Close one from Victoria Road Surgery, one from Southwold estate and one at Bure Park and Langford Medical Centre. The Bicester Community Hospital has physiotherapy and x-ray departments and convalescent facilities but no accident and emergency department.\nAccident and Emergency departments are at the John Radcliffe Hospital in Oxford and the Horton General Hospital in Banbury.\n\n**North Bicester Surgery at Bure Park:**<br />\nhttp://www.northbicestersurgery.co.uk/\n\n**Victoria House Surgery on the Buckingham Road:**<br />\nhttp://www.victoriahousesurgery.co.uk/\n\n**Bicester Health Centre in Coker Close:**<br />\nhttp://www.bicesterhc.co.uk/\n\n**Montgomery House Surgery in Piggy Lane:**<br />\nhttp://www.montgomeryhousesurgery.co.uk/\n\n**Langford Medical Practice in Nightingale Place, Langford Village:**<br />\nhttp://www.langfordmedicalpractice.co.uk/\n\n#### Accident & Emergency:<br />\n**Horton General Hospital**<br />\nHightown, Banbury 01295 275500\n\n**John Radcliffe Hospital**<br />\n Headington, Oxon 01865 741166<br />\n\nDental Surgeries and Veterinary practices can also be found in Bicester.\n\n#### Veterinary Practices\n**Ferens, Cumming & Cornish**<br />\nVictoria Road, Bicester 01869 252077\n\n**Hart Veterinary Centre**<br />\nBrowning Drive, Bicester 01869 323223​​​​​​​\n\n### LEISURE\nStoke Lyne Women's Institute meet in the Parish Meeting Room on the second Wednesday of each month.<br />\nShelswell Lyne Women's Institute meet in the Fringford Village Hall on the first Thursday of each month.<br />\nYouth Club runs from Fringford village hall on most Tuesday evenings from 7:00 to 8:00pm<br />\nStay and Play Group for pre-schoolers and their parents meets Friday mornings, 9:30 until 12:00<br />\nSheswell Garden Club meets on the second Tuesday in the month at Hethe village hall, except in some summer months when outside visits are arranged.<br />\nStratton Audley Historical Society hold regular talks and meetings at The Red Lion Pub (See News items Page for meeting details)<br />\nShelswell Walkers hold monthly walks every second Sunday in the month, usually at 2.30pm (see Parish News for details).<br />\nSport the Sports Centre off Queen's Aveneue, Bicester is an indoor sports and leisure centre, including a swimming area and Bowling alley. The Bicester Sports Club on the Oxford Road organises most outdoor sport.<br />\nBicester Adult Continuing Education provides daytime and evening classes mainly at Bicester Community College.<br />\nA University of the 3rd Age group meets every Tuesday afternoon at the Southwold County Primary School.<br />\n\n\n### LOCAL AUTHORITY\n**Cherwell District Council**\nBodicote House, Banbury 01295 252535\nOX15 4AA\n\n**Social Services**\nOld Place Yard, Bicester 242211\n\n### PARISH COUNCIL\n**Chair:** Mr N Barnes 346029\n\n**Member of Parliament**\nTony Baldry, c/o the Conservative Association,\n16A North Bar, Banbury 01295 262341\n\n### POLICE\n**Bicester Police Station**<br />\nQueens Avenue, Bicester 320919\n\n### LIBRARY\n**Old Place Yard**\nBicester 252181<br />\nMobile Library (renewals etc) 320347<br />\nAlternate Tuesdays, outside The Peyton Arms, 10:00 - 10:20 am<br />\n\n### PARISH NEWS\n**Parish News Correspondent**\nRena Andrews email: renacyanlion@btinternet.com","slug":"about","published_at":"2021-10-18T10:29:30.295Z","created_at":"2021-10-18T10:29:26.695Z","updated_at":"2021-10-18T10:29:30.308Z","optionalComponents":[],"featureImage":{"id":5,"name":"church_outline.png","alternativeText":"","caption":"","width":640,"height":480,"formats":{"thumbnail":{"name":"thumbnail_church_outline.png","hash":"thumbnail_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":208,"height":156,"size":9.18,"path":null,"url":"/uploads/thumbnail_church_outline_7ddd38ba1a.png"},"small":{"name":"small_church_outline.png","hash":"small_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":500,"height":375,"size":32.93,"path":null,"url":"/uploads/small_church_outline_7ddd38ba1a.png"}},"hash":"church_outline_7ddd38ba1a","ext":".png","mime":"image/png","size":44.61,"url":"/uploads/church_outline_7ddd38ba1a.png","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2021-10-14T12:42:26.429Z","updated_at":"2021-10-14T12:42:26.438Z"}},{"id":7,"title":"Stoke Lyne Parish Council","subTitle":null,"pageText":"Parish council text","slug":"parish","published_at":"2022-01-15T14:58:39.058Z","created_at":"2022-01-15T14:44:03.413Z","updated_at":"2022-01-15T15:17:57.505Z","optionalComponents":[{"__component":"user-table.parish-member-table","id":1,"parish_members":[{"id":1,"name":"Phill Elliott 2","Description":"Phil Elliott has lived in Stoke Lyne since 1994 and is a partner in a firm of chartered surveyors. He has been co-opted onto the Parish Council and is interested in promoting the interests of the village.","published_at":"2022-01-15T15:07:53.979Z","created_by":1,"updated_by":1,"created_at":"2022-01-15T15:07:52.893Z","updated_at":"2022-05-06T14:58:02.794Z","DisplayPicture":{"id":25,"name":"Phil.jpg","alternativeText":"","caption":"","width":200,"height":200,"formats":{"thumbnail":{"name":"thumbnail_Phil.jpg","hash":"thumbnail_Phil_557beb5201","ext":".jpg","mime":"image/jpeg","width":156,"height":156,"size":5.76,"path":null,"url":"/uploads/thumbnail_Phil_557beb5201.jpg"}},"hash":"Phil_557beb5201","ext":".jpg","mime":"image/jpeg","size":7.45,"url":"/uploads/Phil_557beb5201.jpg","previewUrl":null,"provider":"local","provider_metadata":null,"created_by":1,"updated_by":1,"created_at":"2022-01-15T15:07:43.753Z","updated_at":"2022-01-15T15:07:43.760Z"}}]}],"featureImage":{"id":5,"name":"church_outline.png","alternativeText":"","caption":"","width":640,"height":480,"formats":{"thumbnail":{"name":"thumbnail_church_outline.png","hash":"thumbnail_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":208,"height":156,"size":9.18,"path":null,"url":"/uploads/thumbnail_church_outline_7ddd38ba1a.png"},"small":{"name":"small_church_outline.png","hash":"small_church_outline_7ddd38ba1a","ext":".png","mime":"image/png","width":500,"height":375,"size":32.93,"path":null,"url":"/uploads/small_church_outline_7ddd38ba1a.png"}},"hash":"church_outline_7ddd38ba1a","ext":".png","mime":"image/png","size":44.61,"url":"/uploads/church_outline_7ddd38ba1a.png","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2021-10-14T12:42:26.429Z","updated_at":"2021-10-14T12:42:26.438Z"}}]